const express = require('express');
const app = express();
app.use(function (req, res, next) {
    res.header("Access-Control-Allow-Origin", "*");
    res.header("Access-Control-Allow-Headers", "Origin, X-Requested-With, Content-Type, Accept");
    next();
});
var bodyParser = require('body-parser');
app.use(bodyParser.json());
app.use(bodyParser.urlencoded({
    extended: false
}));
app.post('/findTeamAndPersonByRecord', function (req, res, next) {
    // 获取参数
    var query = req.body;
    console.log("post请求：参数", query);
    if (query.caseid == 1) {
        res.send({
            "resCode": 1,
            "resMsg": "操作成功",
            "result": {
                "nodes": [{
                    "data": {
                        "address": "江阴市新华三村21幢202室",
                        "rname": "许圆",
                        "name": "J3202815319053000001",
                        "ptype": "电话诈骗",
                        "proceresult": "2019年5月22日11时31分，许圆（微信号：Asura27）在江阴市新华三村21幢202室家中接到+8616529871105催还贷款的电话，并向许圆发送了一个财务工作人员的微信号（微信号：gb55774），许圆加对方微信后收到一个收款二维码，后许圆通过微信绑定的中国工商银行卡（卡号：6222021103011656486）以微信扫码的方式向对方转账人民币2500元，至17时许，其发现微信被拉黑，对方电话不接。5月25日许，许圆注册平安易贷APP，并在该平台链接上联系客服准备贷款，客服以交工本费为由向其发送了一个中国农业银行账号（账户：6230520600062740175，账户名：黄武），许圆通过微信绑定的中国工商银行卡以微信转账的方式向对方转账人民币1500元，后该客服又以账户被冻结为由要求许圆继续转账时，遂发现被骗。损失价值：人民币4000余元（贷款）。",
                        "time": "20190530",
                        "dname": "827325,826368                     ",
                        "categories": 0,
                        "type": "case",
                        "content": "2019年5月22日11时31分，许圆（微信号：Asura27）在江阴市新华三村21幢202室家中接到+8616529871105催还贷款的电话，并向许圆发送了一个财务工作人员的微信号（微信号：gb55774），许圆加对方微信后收到一个收款二维码，后许圆通过微信绑定的中国工商银行卡（卡号：6222021103011656486）以微信扫码的方式向对方转账人民币2500元，至17时许，其发现微信被拉黑，对方电话不接。5月25日许，许圆注册平安易贷APP，并在该平台链接上联系客服，客服以交工本费为由向其发送了一个中国农业银行账号（账户：6230520600062740175，账户名：黄武），许圆通过微信绑定的中国工商银行卡以微信转账的方式向对方转账人民币1500元，后该客服又以账户被冻结为由要求许圆继续转账时，遂发现被骗。损失价值：人民币4000余元。"
                    },
                    "id": "J3202815319053000001"
                }, {
                    "data": {
                        "address": "滨江双牌三村10幢106室",
                        "rname": "谭",
                        "name": "J3202815918041825413",
                        "ptype": "网络诈骗",
                        "proceresult": "2018年04月17日14时50分许，谭华丹在江阴市双牌三村10幢106室时，其手机接到一号码15631142685陌生女子打来的电话，对方自称一家\"邮你贷\"网络贷款公司工作人员，公司是跟京东方合作的，问其有没有需求贷款，谭华丹同意后，通过自己微信（Dan1377123，曲未终人已散）添加对方微信（jt40181，邮你贷客服-068），在微信内，谭华丹按照对方要求扫码安装了\"邮你贷\"APP并填写了自己个人信息后，对方以需支付包装费、申请贷款时填写的银行卡错误无法发放贷款为由让其付款，当天16时13分至17时01分许，谭华丹通过微信绑定的中国农业银行卡（6228480435730159579）向对方提供的二维码（账号不详）扫码支付人民币2900元，2000元，共计人民币4900元，支付完后，谭华丹发现自己并未收到对方发放的贷款，其意识被骗，总计损失人民币4900元。（贷款）",
                        "time": "20180418",
                        "dname": "002066,001232                     ",
                        "categories": 1,
                        "type": "case",
                        "content": "昨天晚上我在网上申请贷款，贷款一直没有下来，现在订单也被取消了，一次说要交平码款，后来说我卡号输错了，让财务解冻，要交解冻金，一共被骗了5000元。都是微信扫码转账的。"
                    },
                    "id": "J3202815918041825413"
                }, {
                    "data": {
                        "address": "夏港海岸城工地",
                        "rname": "罗杰",
                        "name": "J3202816618012397541",
                        "ptype": "电话诈骗",
                        "proceresult": "经调查，系罗杰在江阴市夏港镇镇澄路619号家中玩手机时，有一手机微信号为“xinjinbaoCW”加其微信询问罗是否需要贷款，罗称需支付手续费1300元，后罗在通过微信绑定的中国农业银行卡转账1300元，完成转账后，对方又要求罗继续转账1300元作为手续费，罗遂拒绝，并未收到20000元贷款。",
                        "time": "20180123",
                        "dname": "003584,827309                     ",
                        "categories": 1,
                        "type": "case",
                        "content": "昨天有个电话直接打电话给我说可以办小额贷款，我就相信了， 然后双方通过微信聊天对方称要手续费，我就在上述地址微信转账一千三百多，后来又要交钱，我就怀疑是被骗了。"
                    },
                    "id": "J3202816618012397541"
                }, {
                    "data": {
                        "address": "华士环南路",
                        "rname": "龚",
                        "name": "J3202818018081465794",
                        "ptype": "电话诈骗",
                        "proceresult": "经询问龚敏峰（男，19760122，华士人）称:2018年8月9日11时07分，其号码为13585050325的手机接到号码（0730）3051514的来电，对方在电话中称可帮其办理微粒贷，其信以为真，便通过自己微信（minmin367001）加对方微信为好友（jkjr1231），并提供自己相关证件来办理贷款事宜，后通过微信绑定的中国农业银行卡（6228480434426357811）向对方提供的银行卡（事主暂时无法提供准确卡号）共计两次转账1100元，至2018年8月14日11时许，其发现其办理的贷款迟迟不下款且对方已将其拉黑时方知上当受骗（贷款）制作报案材料一份，拟立刑事案件侦查",
                        "time": "20180814",
                        "dname": "003627,000310                     ",
                        "categories": 1,
                        "type": "case",
                        "content": "几天前有个湖南电话打给我说办理信用卡提额，让我把身份证与手机号码给其，我给了，然后对方说要先交钱，我就手机银行在上述地址转账1100元给对方：赵书行，交通银行卡号622620610022734586，我现在在华士厂里。"
                    },
                    "id": "J3202818018081465794"
                }, {
                    "data": {
                        "address": "江阴市华士镇华中村大陈家基21号",
                        "rname": "郑镇湖",
                        "name": "J3202818019072900002",
                        "ptype": "网络诈骗",
                        "proceresult": "经询问郑镇湖（男，19940223，广东汕头人）称：2019年7月25日，其在网上获悉“捷信金融”可办理贷款，其遂在该网站上（无法提供）填写相关身份信息，后客服称要交纳手续费及保证金，其信以为真，便通过自己支付宝（15251559335）向对方提供的中国工商银行卡（已删除）转账4300元、通过自己微信（Xiaohu15251559335）向对方提供的中国农业银行卡（已删除）转账1700元，至2019年7月29日，其发现贷款未下发且对方还让其继续转账时方知上当受骗。（贷款）制作报案材料一份，拟立刑事案件侦查",
                        "time": "20190729",
                        "dname": "003521,104683                     ",
                        "categories": 1,
                        "type": "case",
                        "content": "2019年7月25日，我在网上下载了一个捷信金融的贷款软件，后客服一直以手续费等为由，收取了我6000元，到现在我发现贷款没有贷款到而且对方还继续让我转账，我觉得被骗了。"
                    },
                    "id": "J3202818019072900002"
                }, {
                    "data": {
                        "address": "市区花园三村35栋404室",
                        "rname": "宋江黎",
                        "name": "J3202815118110841488",
                        "ptype": "干扰他人正常生活",
                        "proceresult": "电话联系报警人宋江黎自行到所处理。",
                        "time": "20181108",
                        "dname": "827154,003576                     ",
                        "categories": 2,
                        "type": "case",
                        "content": "我收到电话骚扰17000387617，对方还把我的头像和身份信息还编辑成了黄色图片，露下体的那种，以短信的形式发给了我所有的通讯录里的人，是因为我朋友借了钱，对方是小贷公司他要让我找到我朋友还钱。我现在在家。"
                    },
                    "id": "J3202815118110841488"
                }],
                "edges": [{
                    "source": "J3202815319053000001",
                    "target": "J3202815918041825413"
                }, {
                    "source": "J3202815319053000001",
                    "target": "J3202816618012397541"
                }, {
                    "source": "J3202815319053000001",
                    "target": "J3202818018081465794"
                }, {
                    "source": "J3202815319053000001",
                    "target": "J3202818019072900002"
                }, {
                    "source": "J3202815118110841488",
                    "target": "J3202815918041825413"
                }, {
                    "source": "J3202815918041825413",
                    "target": "J3202816618012397541"
                }, {
                    "source": "J3202815918041825413",
                    "target": "J3202818018081465794"
                }, {
                    "source": "J3202816618012397541",
                    "target": "J3202818018081465794"
                }]
            }
        })
    } else if (query.caseid == 2) {
        res.send({
            "result": {
                "nodes": [{
                        "data": {
                            "address": "市区昊柏往麦德龙大酒店方向十字路口处",
                            "rname": null,
                            "name": "J3202150101180933051",
                            "ptype": "机动车与机动车",
                            "time": null, //时间字段很可能是 20190711 这个格式的所以前端可能需要处理一下
                            "dname": null,
                            "categories": 0,
                            "type": "case",
                            "content": "宝马苏B865EQ撞出租车，人没事。"
                        },
                        "id": "J3202150101180933051"
                    },
                    {
                        "data": {
                            "address": "市区五星桥东桥堍",
                            "rname": null,
                            "name": "J3202150107085274665",
                            "ptype": "机动车与机动车",
                            "time": null,
                            "dname": null,
                            "categories": 1,
                            "type": "case",
                            "content": "雪佛兰与大众相撞，人没事，我的车牌苏B665EJ。"
                        },
                        "id": "J3202150107085274665"
                    },
                    {
                        "data": {
                            "address": "市区人民路澄江街道门口",
                            "rname": null,
                            "name": "J3202150131160711612",
                            "ptype": "机动车与机动车",
                            "time": null,
                            "dname": null,
                            "categories": 1,
                            "type": "case",
                            "content": "奔驰和出租车相撞，人没事，我的车牌是苏BE817V。"
                        },
                        "id": "J3202150131160711612"
                    },
                    {
                        "data": {
                            "address": "市区杏春桥西面红绿灯",
                            "rname": null,
                            "name": "J3202150211205416649",
                            "ptype": "机动车与机动车",
                            "time": null,
                            "dname": null,
                            "categories": 1,
                            "type": "case",
                            "content": "我的轿车（苏BP2023）和出租车相撞，人没事。"
                        },
                        "id": "J3202150211205416649"
                    },
                    {
                        "data": {
                            "address": "市区文化路行政事业单位往西到江阴大桥桥下",
                            "rname": null,
                            "name": "J3202150521142720623",
                            "ptype": "机动车与机动车",
                            "time": null,
                            "dname": null,
                            "categories": 1,
                            "type": "case",
                            "content": "出租车和普桑擦了，人没事，苏BE817V。"
                        },
                        "id": "J3202150521142720623"
                    },
                    {
                        "data": {
                            "address": "市区毗邻路虹桥南路口",
                            "rname": null,
                            "name": "J3202150514110260850",
                            "ptype": "机动车与机动车",
                            "time": null,
                            "dname": null,
                            "categories": 2,
                            "type": "case",
                            "content": "两辆轿车相撞，人无事，车牌苏B5517X。"
                        },
                        "id": "J3202150514110260850"
                    }
                ],
                "edges": [{
                        "source": "J3202150101180933051",
                        "target": "J3202150107085274665"
                    },
                    {
                        "source": "J3202150101180933051",
                        "target": "J3202150131160711612"
                    },
                    {
                        "source": "J3202150101180933051",
                        "target": "J3202150211205416649"
                    },
                    {
                        "source": "J3202150101180933051",
                        "target": "J3202150521142720623"
                    },
                    {
                        "source": "J3202150107085274665",
                        "target": "J3202150131160711612"
                    },
                    {
                        "source": "J3202150107085274665",
                        "target": "J3202150211205416649"
                    },
                    {
                        "source": "J3202150107085274665",
                        "target": "J3202150521142720623"
                    },
                    {
                        "source": "J3202150131160711612",
                        "target": "J3202150211205416649"
                    },
                    {
                        "source": "J3202150131160711612",
                        "target": "J3202150514110260850"
                    },
                    {
                        "source": "J3202150131160711612",
                        "target": "J3202150521142720623"
                    },
                    {
                        "source": "J3202150211205416649",
                        "target": "J3202150521142720623"
                    },
                    {
                        "source": "J3202150521142720623",
                        "target": "J3202150101180933051"
                    },
                    {
                        "source": "J3202150521142720623",
                        "target": "J3202150107085274665"
                    },
                    {
                        "source": "J3202150521142720623",
                        "target": "J3202150131160711612"
                    },
                    {
                        "source": "J3202150521142720623",
                        "target": "J3202150211205416649"
                    },
                    {
                        "source": "J3202150514110260850",
                        "target": "J3202150131160711612"
                    }
                ]
            }
        })
    } else {
        res.send({
            "result": {
                "nodes": [{
                    "data": {
                        "name": "J3202815319052832224",
                        "time": "20190528",
                        "type": "case"
                    },
                    "id": "J3202815319052832224"
                }, {
                    "data": {
                        "name": "J3202815118121342756",
                        "time": "20181213",
                        "type": "case"
                    },
                    "id": "J3202815118121342756"
                }, {
                    "data": {
                        "name": "J3202816619010891262",
                        "time": "20190108",
                        "type": "case"
                    },
                    "id": "J3202816619010891262"
                }, {
                    "data": {
                        "name": "J3202817817090378830",
                        "time": "20170903",
                        "type": "case"
                    },
                    "id": "J3202817817090378830"
                }, {
                    "data": {
                        "name": "J3202815318120380988",
                        "time": "20181203",
                        "type": "case"
                    },
                    "id": "J3202815318120380988"
                }, {
                    "data": {
                        "name": "J3202817817090274161",
                        "time": "20170902",
                        "type": "case"
                    },
                    "id": "J3202817817090274161"
                }, {
                    "data": {
                        "name": "J3202816218022656657",
                        "time": "20180226",
                        "type": "case"
                    },
                    "id": "J3202816218022656657"
                }, {
                    "data": {
                        "name": "J3202815219071069799",
                        "time": "20190710",
                        "type": "case"
                    },
                    "id": "J3202815219071069799"
                }, {
                    "data": {
                        "name": "J3202816218010386256",
                        "time": "20180103",
                        "type": "case"
                    },
                    "id": "J3202816218010386256"
                }, {
                    "data": {
                        "name": "J3202815318110948827",
                        "time": "20181109",
                        "type": "case"
                    },
                    "id": "J3202815318110948827"
                }, {
                    "data": {
                        "name": "J3202815319020649976",
                        "time": "20190206",
                        "type": "case"
                    },
                    "id": "J3202815319020649976"
                }, {
                    "data": {
                        "name": "J3202815317092617565",
                        "time": "20170926",
                        "type": "case"
                    },
                    "id": "J3202815317092617565"
                }],
                "edges": [{
                    "source": "J3202815319052832224",
                    "target": "J3202815118121342756"
                }, {
                    "source": "J3202815319052832224",
                    "target": "J3202816619010891262"
                }, {
                    "source": "J3202817817090378830",
                    "target": "J3202815118121342756"
                }, {
                    "source": "J3202817817090378830",
                    "target": "J3202815318120380988"
                }, {
                    "source": "J3202817817090378830",
                    "target": "J3202817817090274161"
                }, {
                    "source": "J3202816218022656657",
                    "target": "J3202815219071069799"
                }, {
                    "source": "J3202816218022656657",
                    "target": "J3202816218010386256"
                }, {
                    "source": "J3202815118121342756",
                    "target": "J3202815219071069799"
                }, {
                    "source": "J3202815118121342756",
                    "target": "J3202815318110948827"
                }, {
                    "source": "J3202815118121342756",
                    "target": "J3202815318120380988"
                }, {
                    "source": "J3202815118121342756",
                    "target": "J3202815319020649976"
                }, {
                    "source": "J3202815118121342756",
                    "target": "J3202816619010891262"
                }, {
                    "source": "J3202815118121342756",
                    "target": "J3202817817090274161"
                }, {
                    "source": "J3202815219071069799",
                    "target": "J3202815318110948827"
                }, {
                    "source": "J3202815219071069799",
                    "target": "J3202815319020649976"
                }, {
                    "source": "J3202815318110948827",
                    "target": "J3202815319020649976"
                }, {
                    "source": "J3202815318120380988",
                    "target": "J3202817817090274161"
                }, {
                    "source": "J3202815317092617565",
                    "target": "J3202816619010891262"
                }]
            }
        })
    }

});

app.get('/findPersonTeamByIdCard', function (req, res) {
    res.send({
        "result": {
            "nodes": [{
                    "data": {
                        "name": "刘东升",
                        "categories": 0,
                        "type": "person"
                    },
                    "id": "320281197801238577"
                },
                {
                    "data": {
                        "name": "江苏省无锡市江阴市黄山路大桥一村1号楼3单元501",
                        "categories": 1,
                        "type": "address"
                    },
                    "id": "address:江苏省无锡市江阴市黄山路大桥一村1号楼3单元501"
                },
                {
                    "data": {
                        "name": "江苏省无锡市江阴市黄山路大桥一村1号楼3单元501",
                        "categories": 1,
                        "type": "address"
                    },
                    "id": "address:江苏省无锡市江阴市黄山路大桥一村1号楼3单元501"
                },
                {
                    "data": {
                        "name": "山东省济南市万科中心12楼",
                        "categories": 1,
                        "type": "CM"
                    },
                    "id": "CM:山东省济南市万科中心12楼"
                },
                {
                    "data": {
                        "name": "J3202150107085274665",
                        "categories": "1",
                        "type": "case"
                    },
                    "id": "J3202150107085274665"
                },
                {
                    "data": {
                        "name": "J3202150101180933051",
                        "categories": "1",
                        "type": "case"
                    },
                    "id": "J3202150101180933051"
                },
                {
                    "data": {
                        "name": "J3202150131160711612",
                        "categories": "1",
                        "type": "case"
                    },
                    "id": "J3202150131160711612"
                },
                {
                    "data": {
                        "name": "J3202150211205416649",
                        "categories": 2,
                        "type": "case"
                    },
                    "id": "J3202150211205416649"
                },
                {
                    "data": {
                        "name": "J3202150521142720623",
                        "categories": 2,
                        "type": "case"
                    },
                    "id": "J3202150521142720623"
                },
                {
                    "data": {
                        "name": "J3202150514110260850",
                        "categories": 2,
                        "type": "case"
                    },
                    "id": "J3202150514110260850"
                },
                {
                    "data": {
                        "score": 0.37994896225522484,
                        "name": "居君彪",
                        "categories": 2,
                        "type": "person"
                    },
                    "id": "320281195509062409"
                },
                {
                    "data": {
                        "score": 0.19737532022490403,
                        "name": "王少波",
                        "categories": 3,
                        "type": "person"
                    },
                    "id": "320281198803027655"
                },
                {
                    "data": {
                        "score": 0.8853516482022624,
                        "name": "周峰",
                        "categories": 2,
                        "type": "person"
                    },
                    "id": "320281198011259607"
                },
                {
                    "data": {
                        "name": "江阴天胜康食品贸易有限公司",
                        "categories": 2,
                        "type": "serplace"
                    },
                    "id": "serplace:江阴天胜康食品贸易有限公司"
                },
                {
                    "data": {
                        "score": 0.1325487883908784,
                        "name": "陈林燕",
                        "categories": 3,
                        "type": "person"
                    },
                    "id": "320281199203045567"
                },
                {
                    "data": {
                        "score": 0.19737532022490403,
                        "name": "宋惠新",
                        "categories": 3,
                        "type": "person"
                    },
                    "id": "320281197909039988"
                },
                {
                    "data": {
                        "score": 0.19737532022490403,
                        "name": "任静霞",
                        "categories": 3,
                        "type": "person"
                    },
                    "id": "320281197809152377"
                },
                {
                    "data": {
                        "score": 0.8086365140907334,
                        "name": "陈晔",
                        "categories": 3,
                        "type": "person"
                    },
                    "id": "320281198312250960"
                },
                {
                    "data": {
                        "name": "山东省济南市",
                        "categories": 2,
                        "type": "CM"
                    },
                    "id": "CM:山东省济南市"
                },
                {
                    "data": {
                        "name": "山东省济南市万科中心11楼",
                        "categories": 2,
                        "type": "CM"
                    },
                    "id": "CM:山东省济南市万科中心11楼"
                }
            ],
            "edges": [{
                    "source": "320281197801238577",
                    "target": "J3202150107085274665"
                },
                {
                    "source": "320281197801238577",
                    "target": "J3202150101180933051"
                },
                {
                    "source": "320281197801238577",
                    "target": "J3202150131160711612"
                },
                {
                    "source": "J3202150107085274665",
                    "target": "320281195509062409"
                },
                {
                    "source": "J3202150131160711612",
                    "target": "J3202150514110260850"
                },
                {
                    "source": "J3202150101180933051",
                    "target": "320281198011259607"
                },
                {
                    "source": "address:江苏省无锡市江阴市黄山路大桥一村1号楼3单元501",
                    "target": "320281198011259607"
                },
                {
                    "source": "serplace:江阴天胜康食品贸易有限公司",
                    "target": "320281198011259607"
                },
                {
                    "source": "J3202150131160711612",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150521142720623",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150101180933051",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150521142720623",
                    "target": "J3202150131160711612"
                },
                {
                    "source": "J3202150521142720623",
                    "target": "J3202150101180933051"
                },
                {
                    "source": "J3202150107085274665",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150107085274665",
                    "target": "J3202150521142720623"
                },
                {
                    "source": "J3202150131160711612",
                    "target": "320281197809152377"
                },
                {
                    "source": "J3202150131160711612",
                    "target": "J3202150514110260850"
                },
                {
                    "source": "CM:山东省济南市万科中心12楼",
                    "target": "CM:山东省济南市"
                },
                {
                    "source": "CM:山东省济南市",
                    "target": "320281198312250960"
                },
                {
                    "source": "CM:山东省济南市万科中心12楼",
                    "target": "CM:山东省济南市万科中心11楼"
                },
                {
                    "source": "CM:山东省济南市万科中心11楼",
                    "target": "320281198312250960"
                },
                {
                    "source": "J3202150131160711612",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150521142720623",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150101180933051",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150521142720623",
                    "target": "J3202150131160711612"
                },
                {
                    "source": "J3202150521142720623",
                    "target": "J3202150101180933051"
                },
                {
                    "source": "J3202150107085274665",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150107085274665",
                    "target": "J3202150521142720623"
                }
            ]
        }
    })
});
app.get('/findRelevanceFacotr', (req, res) => {
    res.send({
        "result": {
            "nodes": [{
                    "data": {
                        "address": "申港申裕苑2期4幢103室",
                        "rname": "匿名",
                        "name": "J3202816717081573347",
                        "ptype": "260503",
                        "time": "20170815",
                        "dname": "827359,001617                     ",
                        "type": "case",
                        "content": "有一个人一直呆在我家不肯走，问其何事称因为债务纠纷，告知可跟对方好好协商或跟对方协商分期付款，协商不了可走司法途径，其称协商不了，向其解释不通。"
                    },
                    "id": "J3202816717081573347"
                },
                {
                    "data": {
                        "address": "申港申裕苑二期2栋",
                        "rname": "匿名",
                        "name": "J3202816717081259572",
                        "ptype": "260503",
                        "time": "20170812",
                        "dname": "003600,001617                     ",
                        "type": "case",
                        "content": "一大早有人开了车在放高音喇叭，欠债还钱之类的。应该是姓毛的人家。"
                    },
                    "id": "J3202816717081259572"
                },
                {
                    "data": {
                        "name": "姜亮亮",
                        "type": 0
                    },
                    "id": "factor0"
                },
                {
                    "data": {
                        "name": "341223199301014330",
                        "type": 6
                    },
                    "id": "factor1"
                }
            ],
            "edges": [{
                    "source": "J3202816717081573347",
                    "target": "factor0"
                },
                {
                    "source": "factor0",
                    "target": "J3202816717081259572"
                },
                {
                    "source": "J3202816717081573347",
                    "target": "factor1"
                },
                {
                    "source": "factor1",
                    "target": "J3202816717081259572"
                }
            ]
        }
    })
});
app.get('/findTeamByRecordId', function (req, res) {
    res.send({
        "result": {
            "nodes": [{
                    "data": {
                        "address": "市区昊柏往麦德龙大酒店方向十字路口处",
                        "rname": null,
                        "name": "J3202150101180933051",
                        "ptype": "机动车与机动车",
                        "time": null, //时间字段很可能是 20190711 这个格式的所以前端可能需要处理一下
                        "dname": null,
                        "categories": 0,
                        "type": "case",
                        "content": "宝马苏B865EQ撞出租车，人没事。"
                    },
                    "id": "J3202150101180933051"
                },
                {
                    "data": {
                        "address": "市区五星桥东桥堍",
                        "rname": null,
                        "name": "J3202150107085274665",
                        "ptype": "机动车与机动车",
                        "time": null,
                        "dname": null,
                        "categories": 1,
                        "type": "case",
                        "content": "雪佛兰与大众相撞，人没事，我的车牌苏B665EJ。"
                    },
                    "id": "J3202150107085274665"
                },
                {
                    "data": {
                        "address": "市区人民路澄江街道门口",
                        "rname": null,
                        "name": "J3202150131160711612",
                        "ptype": "机动车与机动车",
                        "time": null,
                        "dname": null,
                        "categories": 1,
                        "type": "case",
                        "content": "奔驰和出租车相撞，人没事，我的车牌是苏BE817V。"
                    },
                    "id": "J3202150131160711612"
                },
                {
                    "data": {
                        "address": "市区杏春桥西面红绿灯",
                        "rname": null,
                        "name": "J3202150211205416649",
                        "ptype": "机动车与机动车",
                        "time": null,
                        "dname": null,
                        "categories": 1,
                        "type": "case",
                        "content": "我的轿车（苏BP2023）和出租车相撞，人没事。"
                    },
                    "id": "J3202150211205416649"
                },
                {
                    "data": {
                        "address": "市区文化路行政事业单位往西到江阴大桥桥下",
                        "rname": null,
                        "name": "J3202150521142720623",
                        "ptype": "机动车与机动车",
                        "time": null,
                        "dname": null,
                        "categories": 1,
                        "type": "case",
                        "content": "出租车和普桑擦了，人没事，苏BE817V。"
                    },
                    "id": "J3202150521142720623"
                },
                {
                    "data": {
                        "address": "市区毗邻路虹桥南路口",
                        "rname": null,
                        "name": "J3202150514110260850",
                        "ptype": "机动车与机动车",
                        "time": null,
                        "dname": null,
                        "categories": 2,
                        "type": "case",
                        "content": "两辆轿车相撞，人无事，车牌苏B5517X。"
                    },
                    "id": "J3202150514110260850"
                }
            ],
            "edges": [{
                    "source": "J3202150101180933051",
                    "target": "J3202150107085274665"
                },
                {
                    "source": "J3202150101180933051",
                    "target": "J3202150131160711612"
                },
                {
                    "source": "J3202150101180933051",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150101180933051",
                    "target": "J3202150521142720623"
                },
                {
                    "source": "J3202150107085274665",
                    "target": "J3202150131160711612"
                },
                {
                    "source": "J3202150107085274665",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150107085274665",
                    "target": "J3202150521142720623"
                },
                {
                    "source": "J3202150131160711612",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150131160711612",
                    "target": "J3202150514110260850"
                },
                {
                    "source": "J3202150131160711612",
                    "target": "J3202150521142720623"
                },
                {
                    "source": "J3202150211205416649",
                    "target": "J3202150521142720623"
                },
                {
                    "source": "J3202150521142720623",
                    "target": "J3202150101180933051"
                },
                {
                    "source": "J3202150521142720623",
                    "target": "J3202150107085274665"
                },
                {
                    "source": "J3202150521142720623",
                    "target": "J3202150131160711612"
                },
                {
                    "source": "J3202150521142720623",
                    "target": "J3202150211205416649"
                },
                {
                    "source": "J3202150514110260850",
                    "target": "J3202150131160711612"
                }
            ]
        }
    })
});
// app.get('/findTeamAndPersonByRecord', function (req, res) {
//     res.send({
//         "result": {
//             "nodes": [{
//                     "data": {
//                         "serplace": "江阴天胜康食品贸易有限公司",
//                         "idcard": "320281197801238577",
//                         "name": "刘东升",
//                         "contactel": null,
//                         "CM": "江苏省江阴市",
//                         "type": "person"
//                     },
//                     "name": "刘东升",
//                     "id": "320281197801238577"
//                 },
//                 {
//                     "data": {
//                         "serplace": "江阴市得名暖通设备有限公司",
//                         "idcard": "320281198011259607",
//                         "name": "周峰",
//                         "contactel": null,
//                         "CM": "浙江省金华市",
//                         "type": "person"
//                     },
//                     "name": "周峰",
//                     "id": "320281198011259607"
//                 },
//                 {
//                     "data": {
//                         "serplace": "江阴翰志汽车服务有限公司",
//                         "idcard": "320281195509062409",
//                         "name": "居君彪",
//                         "contactel": null,
//                         "CM": "江苏省江阴市",
//                         "type": "person"
//                     },
//                     "name": "居君彪",
//                     "id": "320281195509062409"
//                 },
//                 {
//                     "data": {
//                         "serplace": "江苏铂格网络科技有限公司",
//                         "idcard": "320281197809152377",
//                         "name": "任静霞",
//                         "contactel": null,
//                         "CM": "江苏省江阴市",
//                         "type": "person"
//                     },
//                     "name": "任静霞",
//                     "id": "320281197809152377"
//                 },
//                 {
//                     "data": {
//                         "serplace": "江阴英杰体育文化有限公司",
//                         "idcard": "320281198312250960",
//                         "name": "陈晔",
//                         "contactel": null,
//                         "CM": "山东省济南市",
//                         "type": "person"
//                     },
//                     "name": "陈晔",
//                     "id": "320281198312250960"
//                 },
//                 {
//                     "data": {
//                         "serplace": "江苏垦乐节能环保科技有限公司",
//                         "idcard": "320281199203045567",
//                         "name": "陈林燕",
//                         "contactel": null,
//                         "CM": "河北省保定市",
//                         "type": "person"
//                     },
//                     "name": "陈林燕",
//                     "id": "320281199203045567"
//                 },
//                 {
//                     "data": {
//                         "serplace": "烟台味尚餐饮管理有限公司江阴分公司",
//                         "idcard": "320281197909039988",
//                         "name": "宋惠新",
//                         "contactel": null,
//                         "CM": "安徽省合肥市",
//                         "type": "person"
//                     },
//                     "name": "宋惠新",
//                     "id": "320281197909039988"
//                 },
//                 {
//                     "data": {
//                         "serplace": "上海中克世电子科技有限公司江阴分公司",
//                         "idcard": "320281198803027655",
//                         "name": "王少波",
//                         "contactel": null,
//                         "CM": "江苏省江阴市",
//                         "type": "person"
//                     },
//                     "name": "王少波",
//                     "id": "320281198803027655"
//                 },
//                 {
//                     "data": {
//                         "address": "市区昊柏往麦德龙大酒店方向十字路口处",
//                         "rname": null,
//                         "name": "J3202150101180933051",
//                         "ptype": "机动车与机动车",
//                         "time": "20190711",
//                         "dname": null,
//                         "categories": 0,
//                         "type": "case",
//                         "content": "宝马苏B865EQ撞出租车，人没事。"
//                     },
//                     "id": "J3202150101180933051"
//                 },
//                 {
//                     "data": {
//                         "address": "市区五星桥东桥堍",
//                         "rname": null,
//                         "name": "J3202150107085274665",
//                         "ptype": "机动车与机动车",
//                         "time": null,
//                         "dname": null,
//                         "type": "case",
//                         "content": "雪佛兰与大众相撞，人没事，我的车牌苏B665EJ。"
//                     },
//                     "id": "J3202150107085274665"
//                 },
//                 {
//                     "data": {
//                         "address": "市区人民路澄江街道门口",
//                         "rname": null,
//                         "name": "J3202150131160711612",
//                         "ptype": "机动车与机动车",
//                         "time": null,
//                         "dname": null,
//                         "type": "case",
//                         "content": "奔驰和出租车相撞，人没事，我的车牌是苏BE817V。"
//                     },
//                     "id": "J3202150131160711612"
//                 },
//                 {
//                     "data": {
//                         "address": "市区杏春桥西面红绿灯",
//                         "rname": null,
//                         "name": "J3202150211205416649",
//                         "ptype": "机动车与机动车",
//                         "time": null,
//                         "dname": null,
//                         "type": "case",
//                         "content": "我的轿车（苏BP2023）和出租车相撞，人没事。"
//                     },
//                     "id": "J3202150211205416649"
//                 },
//                 {
//                     "data": {
//                         "address": "市区文化路行政事业单位往西到江阴大桥桥下",
//                         "rname": null,
//                         "name": "J3202150521142720623",
//                         "ptype": "机动车与机动车",
//                         "time": null,
//                         "dname": null,
//                         "type": "case",
//                         "content": "出租车和普桑擦了，人没事，苏BE817V。"
//                     },
//                     "id": "J3202150521142720623"
//                 },
//                 {
//                     "data": {
//                         "address": "市区毗邻路虹桥南路口",
//                         "rname": null,
//                         "name": "J3202150514110260850",
//                         "ptype": "机动车与机动车",
//                         "time": null,
//                         "dname": null,
//                         "type": "case",
//                         "content": "两辆轿车相撞，人无事，车牌苏B5517X。"
//                     },
//                     "id": "J3202150514110260850"
//                 }
//             ],
//             "edges": [{
//                     "source": "J3202150101180933051",
//                     "target": "320281197801238577"
//                 },
//                 {
//                     "source": "J3202150101180933051",
//                     "target": "320281198011259607"
//                 },
//                 {
//                     "source": "J3202150107085274665",
//                     "target": "320281195509062409"
//                 },
//                 {
//                     "source": "J3202150107085274665",
//                     "target": "320281197801238577"
//                 },
//                 {
//                     "source": "J3202150131160711612",
//                     "target": "320281197809152377"
//                 },
//                 {
//                     "source": "J3202150131160711612",
//                     "target": "320281197801238577"
//                 },
//                 {
//                     "source": "J3202150211205416649",
//                     "target": "320281198312250960"
//                 },
//                 {
//                     "source": "J3202150211205416649",
//                     "target": "320281199203045567"
//                 },
//                 {
//                     "source": "J3202150521142720623",
//                     "target": "320281198312250960"
//                 },
//                 {
//                     "source": "J3202150521142720623",
//                     "target": "320281197909039988"
//                 },
//                 {
//                     "source": "J3202150514110260850",
//                     "target": "320281197809152377"
//                 },
//                 {
//                     "source": "J3202150514110260850",
//                     "target": "320281198803027655"
//                 },
//                 {
//                     "source": "J3202150101180933051",
//                     "target": "J3202150107085274665"
//                 },
//                 {
//                     "source": "J3202150101180933051",
//                     "target": "J3202150131160711612"
//                 },
//                 {
//                     "source": "J3202150101180933051",
//                     "target": "J3202150211205416649"
//                 },
//                 {
//                     "source": "J3202150101180933051",
//                     "target": "J3202150521142720623"
//                 },
//                 {
//                     "source": "J3202150107085274665",
//                     "target": "J3202150131160711612"
//                 },
//                 {
//                     "source": "J3202150107085274665",
//                     "target": "J3202150211205416649"
//                 },
//                 {
//                     "source": "J3202150107085274665",
//                     "target": "J3202150521142720623"
//                 },
//                 {
//                     "source": "J3202150131160711612",
//                     "target": "J3202150211205416649"
//                 },
//                 {
//                     "source": "J3202150131160711612",
//                     "target": "J3202150514110260850"
//                 },
//                 {
//                     "source": "J3202150131160711612",
//                     "target": "J3202150521142720623"
//                 },
//                 {
//                     "source": "J3202150211205416649",
//                     "target": "J3202150521142720623"
//                 },
//                 {
//                     "source": "J3202150521142720623",
//                     "target": "J3202150101180933051"
//                 },
//                 {
//                     "source": "J3202150521142720623",
//                     "target": "J3202150107085274665"
//                 },
//                 {
//                     "source": "J3202150521142720623",
//                     "target": "J3202150131160711612"
//                 },
//                 {
//                     "source": "J3202150521142720623",
//                     "target": "J3202150211205416649"
//                 },
//                 {
//                     "source": "J3202150514110260850",
//                     "target": "J3202150131160711612"
//                 }
//             ]
//         }
//     })
// });

app.listen(5000, function () {
    console.log('Example app listening on port 5000!');
})